# KgPerM Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..KgPerM Property
SymbolTypeId Class See Also
---
Symbol kg/m, indicating unit Kilograms per meter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId KgPerM { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KgPerM As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KgPerM {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace